// 1. 【核心對照表】定義哪個勢力擁有哪幾個主題
const categoryMap = {
    "POE流亡暗道": ["教學攻略", "流派收藏", "故事劇情", "二次創作", "藏身處", "休閒日常",],
    "☯東方Project": ["博麗神主ZUN", "原作", "二次創作",],
    "藝術學院": ["劇本", "繪圖", "動畫", "3D", "攝影|影片|剪輯", "舞蹈|動作|武術", "樂理|配樂|音效",],
    "休閒牧場": ["休閒牧場", "ACG同好會", "Vtuber", "這是什麼酷酷的東西", "健身|養身", "體育運動", "棋類技藝", "風水|玄學|靈異|怪異",],
    "社會學院": ["社會學", "吹哨者", "台灣[Taiwan]",],
    "人生哲學": ["人生哲學", "戀愛研究院", "商學院",],
    "生活日常": ["生活日常", "裝扮造型風格", "飲食", "清潔打掃",],
    "音樂收藏": ["淺層", "中層", "深層", "臨界層", "凝界層", "音樂探討", "樂理八卦", "音樂資源",],
    "程式語言": ["HTML", "CSS", "JavaScript", "python", "命令提示字元", "AutoHotkey",],
    "學術領域": ["醫學", "科學", "科技", "軍武", "工匠技藝", "建築學", "生物學", "軟體硬體應用", "泛科普教育",],
    "語言研究院": ["中文", "英文", "日文",],
    "遊戲製作": ["Godot", "Unity",],
    "系列主題": ["柯文哲-先行者", "黃國昌-通識課", "陳之漢-義士", "陳椒華-循道者",],
    "台灣民眾黨專區": ["台灣民眾黨專區", "街頭活動", "小草專區",],
    // 💡 如果有新增的勢力，依樣畫葫蘆加在下面即可
};

// 2. 【大全清單】當使用者選回「系列勢力（全部）」時，要秀出的所有主題
const allCategories = [
 " ",
];

const workData = [
    { date: '2026-07-15', path: '⛩︎', pathUrl: 'https://gemini.google.com/share/9712e94b6021', area: ' 《青丘茶館》', category: ' 《2026》', title: ' 呆呆教授', rarity: ' 稀有', prefix: ' 編年史', suffix: ' 呆呆叫/' },
    { date: '日期', path: '章節/輿圖', pathUrl: 'https://swallow-234.github.io/swallow_234/%E5%85%AC%E4%BD%88%E6%AC%84', area: '系列勢力', category: '主題 ', title: '標題 ', rarity: '稀有度 ', prefix: '前綴 ', suffix: '後綴 ' }
];
const workData2 = [...workData].sort((a, b) => {
        return b.date.localeCompare(a.date);
    });