// 1. 【核心對照表】定義哪個勢力擁有哪幾個主題
const categoryMap = {
    " ": ["法律", "法規命令", "行政規則", "地方法規", "法規草案", "臨時提案", ],
    "民眾黨": ["法律", "法規命令", "行政規則", "地方法規", "法規草案", "臨時提案", ],
    "國民黨": ["法律", "法規命令", "行政規則", "地方法規", "法規草案", "臨時提案", ],
    "民進黨": ["法律", "法規命令", "行政規則", "地方法規", "法規草案", "臨時提案", ],
    // 💡 如果有新增的勢力，依樣畫葫蘆加在下面即可
};

// 2. 【大全清單】當使用者選回「系列勢力（全部）」時，要秀出的所有主題
const allCategories = [
"法律", "法規命令", "行政規則", "地方法規", "法規草案", "臨時提案", 
];

// 1. 原始資料庫 (表格1 的真實內容)
//外交與國防：國際、邦交、國防軍事戰略、國家安全。
//經濟與財政：產業發展、貿易、科技創新、國家預算、稅收制度、貨幣供給及金融管理。
//社會與民生：勞動權益、社會福利、住宅正義、公共衛生及醫療保健。
//教育與文化：國民教育、高等教育、體育發展、文化資產保護及文化傳播。
//環境與基礎建設：環境保護、自然生態、氣候變遷因應、交通運輸及公共工程。
//法治與行政：司法改革、治安維護、廉政建設、公務員體制及選舉制度。
//經過專案整理，則為「動動鼠」。
//可以複選。
// 日期｜《吟遊詩章》 ｜政黨黨團 ｜法案名稱n-n條（增修內容）｜重要性｜前綴 法案閹割/法案修惡（關聯性的法案草案）｜後綴 ｘｘ委員會、院會 ×（事件原因） 
const workData = [
    { date: '2026-10-20', path: '', pathUrl: '', area: ' 民進黨', category: ' 臨時提案', title: '臨時提案臨-110016<br>立法院議案關係文書 中華民國 114 年 10 月 14 日印發<br><br>案由：本院委員陳瑩、莊瑞雄、伍麗華 Saidhai Tahovecahe、陳冠廷、王美惠、黃秀芳、陳秀寳、劉建國、蔡易餘、許智傑、林岱樺、郭國文等 27 人，鑑於憲法第 143 條「國家對於土地之分配與整理，應以扶植自耕農及自行使用土地人為原則」所揭櫫之國家土地政策，且為落實「農地農有」精神，政府有義務協助農民取得土地所有權。惟公地放領政策經三階段實施後，91 年起陸續停辦宜農、牧、林之山坡地、平地耕地、養殖用地等放領，目前國家公有土地政策，除具特殊條件情況外，公有土地均為不出售為原則。爰此，要求行政院重啟「公地放領」政策，且依法放租認定時間點，應訂於 98 年 5月 27 日推動「小地主大佃農」政策前有租賃關係者，實踐憲法精神。是否有當？請公決案。<br><br><br>說明：<br>一、民國 40 年間，政府為實現憲法所定之國家土地政策，實施公地放領，臺灣省公地放領工作，於民國 65 年停止，此為「早期公地放領」；民國 78 提出「專案辦理」；最後於民國83 年實施「續辦公地放領」，此為臺灣公地放領三階段。<br>二、相關「公地放領」政策於 91 年起陸續停辦，現今公有土地出售規定，僅限於具特殊條件者，與憲法意旨相悖，喪失扶植自耕農取得土地之精神。<br>三、政府已將「農地農有」精神入法，惟目前各公有土地管理機關出售土地規定，並無積極協助農民取得農地，雖政府於 98 年 5 月 27 日推行「小地主大佃農」政策，協助農民租用農地種植，但仍未符憲法第 143 條「農地農有」之理念與精神。<br>四、本案建請行政院訂定第四階段公地放領政策，原規範申請公地放領資格，「依法承租」之認定為 65 年 9 月 24 日前，應改為 98 年 5 月 27 日「小地主大佃農」政策推動前。<br><br>提案人：陳 瑩 莊瑞雄 伍麗華 SaidhaiTahovecahe 陳冠廷 王美惠 黃秀芳 陳秀寳 劉建國 蔡易餘 許智傑 林岱樺 郭國文 <br><br>連署人：郭昱晴 陳俊宇 王正旭 黃建賓 陳培瑜 賴惠員 林月琴 游 顥 黃 捷 范 雲 李坤城 鍾佳濱 邱志偉 林思銘 楊 曜 <br><br>－－－<br>＃永夜暗夜：<br>［公地放領］是指政府將公有耕地或養殖用地，依照法定程序優先放領給符合條件的承租農民，『農民在繳清地價後即可取得土地所有權』。', rarity: ' 重度', prefix: ' 法案修惡', suffix: ' 院會<br>土地炒作<br>房價炒作<br>環境破壞<br>糧食危機' },
    { date: '1997-08-24', path: '⛨', pathUrl: 'https://swallow-234.github.io/swallow_234/%E3%80%8A%E6%B0%B8%E5%A4%9C%E6%9A%97%E5%A4%9C%E3%80%8B/%E3%80%8A%E6%B0%B8%E5%A4%9C%E6%9A%97%E5%A4%9C%E3%80%8B.html', area: ' 《永夜暗夜》', category: ' 《法學院》', title: ' 夜晚的奏鳴曲', rarity: ' 上古神話', prefix: ' 青丘之燕', suffix: ' 牧野之戰' },
    { date: '日期', path: '章節/輿圖', pathUrl: 'https://swallow-234.github.io/swallow_234/%E5%85%AC%E4%BD%88%E6%AC%84', area: '系列勢力', category: '主題 ', title: '標題 ', rarity: '稀有度 ', prefix: '前綴 ', suffix: '後綴 ' }
];
const workData2 = [...workData].sort((a, b) => {
        return b.date.localeCompare(a.date);
    });