// 1. 【核心對照表】定義哪個勢力擁有哪幾個主題
const categoryMap = {
    " ": ["法律", "法規命令", "行政規則", "地方法規", "法規草案", ],
    "民眾黨": ["法律", "法規命令", "行政規則", "地方法規", "法規草案", ],
    "國民黨": ["法律", "法規命令", "行政規則", "地方法規", "法規草案", ],
    "民進黨": ["法律", "法規命令", "行政規則", "地方法規", "法規草案", ],
    // 💡 如果有新增的勢力，依樣畫葫蘆加在下面即可
};

// 2. 【大全清單】當使用者選回「系列勢力（全部）」時，要秀出的所有主題
const allCategories = [
"法律", "法規命令", "行政規則", "地方法規", "法規草案", 
];

// 1. 原始資料庫 (表格1 的真實內容)
//外交與國防：國際、邦交、國防軍事戰略、國家安全。
//經濟與財政：產業發展、貿易、科技創新、國家預算、稅收制度、貨幣供給及金融管理。
//社會與民生：勞動權益、社會福利、住宅正義、公共衛生及醫療保健。
//教育與文化：國民教育、高等教育、體育發展、文化資產保護及文化傳播。
//環境與基礎建設：環境保護、自然生態、氣候變遷因應、交通運輸及公共工程。
//法治與行政：司法改革、治安維護、廉政建設、公務員體制及選舉制度。
//經過專案整理，則為「動動鼠」。
//可以複選。
// 日期｜《吟遊詩章》 ｜政黨黨團 ｜法案名稱n-n條（增修內容）｜重要性｜前綴 法案閹割/法案修惡（關聯性的法案草案）｜後綴 ｘｘ委員會、院會 ×（事件原因） 
const workData = [
    { date: '1997-08-24', path: '⛨', pathUrl: 'https://swallow-234.github.io/swallow_234/%E3%80%8A%E6%B0%B8%E5%A4%9C%E6%9A%97%E5%A4%9C%E3%80%8B/%E3%80%8A%E6%B0%B8%E5%A4%9C%E6%9A%97%E5%A4%9C%E3%80%8B.html', area: ' 《永夜暗夜》', category: ' 《法學院》', title: ' 夜晚的奏鳴曲', rarity: ' ☯', prefix: ' 青丘之燕', suffix: ' 牧野之戰' },
    { date: '日期', path: '章節/輿圖', pathUrl: 'https://swallow-234.github.io/swallow_234/%E5%85%AC%E4%BD%88%E6%AC%84', area: '系列勢力', category: '主題 ', title: '標題 ', rarity: '稀有度 ', prefix: '前綴 ', suffix: '後綴 ' }
];
const workData2 = [...workData].sort((a, b) => {
        return b.date.localeCompare(a.date);
    });